Repository: MaestriHub/localization
Catalog: IOS/ErrorLocalizable.xcstrings
Source language: en
Languages: ru

# Access token invalid
source: Access token is invalid
ru: Верный токен доступа

source: Apple token is empty
ru: Apple токен отсутствует

source: FCM token is empty
ru: FCM токен пуст

# Official apple token FCM unsupported
source: Official Apple FCM token is unsupported
ru: Официальный Apple токен для FCM не поддерживается

# url Не парсится
source: URL cannot be parsed
ru: URL не удается распознать

# айдишнику в квери плохо
source: Query Ids is invalid
ru: Идентификатор в запросе некорректен

# Аппоинтмент уже отменен
source: The appointment is already cancelled
ru: Запись уже отменена

source: Database conflict: two active users are associated with the same contact
ru: В базе данных конфликт: два разных активных пользователя используют один контакт

# Вась, json ХУЕвый
source: Invalid JSON, please fix
ru: Плохой JSON, исправь

# Вась, query ХУЕвый
source: Query is invalid, please fix
ru: Плохой запрос, исправь

# Время не спарсилось
source: Time parsing failed
ru: Не удалось распарсить время

# Выдаем зарплату сотруднику, у которого нет даты создания
source: Issuing payroll to an employee without a creation date
ru: Выдаём зарплату сотруднику без даты создания

# Есть мастера с данной должностью
source: There are professionals with this position
ru: Есть мастера с данной должностью

# Инициатор не работает в салоне
source: The initiator does not work at this salon
ru: Инициатор не работает в этом салоне

# Кастомер не участвует в этом аппоинтменте
source: Customer is not part of this appointment
ru: Клиент не участвует в этой записи

# Кастомеру не принадлежат запрашиваемые контакты
source: The requested contacts do not belong to the customer
ru: Запрашиваемые контакты не принадлежат клиенту

# Контакт существует у данного кастомера
source: Contact already exists with this customer
ru: Контакт уже существует у этого клиента

# Контакт существует у данного пользователя
source: Contact already exists with this user
ru: Контакт уже существует у этого пользователя

# Контакт существует у другого пользователя
source: Contact already exists with another user
ru: Контакт уже существует у другого пользователя

# Контакт существует у другого юзера
source: Contact already exists with another user
ru: Контакт уже существует у другого пользователя

# Контакт существует у кастомера в этом салоне
source: Customer's contact already exists in this salon
ru: Контакт уже существует у клиента в этом салоне

# Контакт существует у этого эмплоера
source: Contact already exists with this employer
ru: Контакт уже существует у этого работодателя

# Мастер не умеет делать что-то из процедур
source: The professional is not qualified to perform this procedure
ru: Мастер не обладает квалификацией для выполнения этой процедуры

# Мертвый кастомер не посещавший салоны
source: Inactive customer who hasn't visited any salons
ru: Неактивный клиент, который не посещал салоны

# Не нашли owner
source: Owner not found
ru: Владелец не найден

# Не нашли аппоинтмент
source: Appointment not found
ru: Запись на прием не найдена

# Не нашли девайс
source: Device not found
ru: Устройство не найдено

# Не нашли запись
source: Record not found
ru: Запись не найдена

# Не нашли кастомера
source: Customer not found
ru: Клиент не найден

# Не нашли оффтайм
source: Offtime not found
ru: Отсутствие времени не найдено

# Не нашли позицию
source: Position not found
ru: Позиция не найдена

# Не нашли процедуру
source: Procedure not found
ru: Процедура не найдена

# Не нашли салон
source: Salon not found
ru: Салон не найден

# Не нашли сервис
source: Service not found
ru: Сервис не найден

# Не нашли такого кастомера
source: Customer not found
ru: Клиент не найден

# Не нашли эмплоера
source: Employer not found
ru: Работодатель не найден

# Не овнер пытается дать овнера
source: Not the owner trying to assign another owner
ru: Не владелец пытается назначить другого владельца

# Не получилось залогиниться под кастомером
source: Failed to log in as customer
ru: Не удалось войти под клиентом

# Не получилось залогиниться под профессионалом
source: Failed to log in as professional
ru: Не удалось войти под профессионалом

# Не спарсился тайм интервал
source: Time interval parsing failed
ru: Не удалось распарсить временной интервал

# Не является участником аппоинтмента
source: Not a participant in the appointment
ru: Не является участником записи

# Нет возможности удалить
source: Unable to delete
ru: Нет возможности удалить

# Нет данных
source: No data
ru: Нет данных

# Нет доступа для активации
source: No access to activate
ru: Нет доступа для активации

# Нет доступа для деактивации
source: No access to deactivate
ru: Нет доступа для деактивации

# Нет доступа для изменения
source: No access to modify
ru: Нет доступа для изменения

# Нет доступа для обновления
source: No access to update
ru: Нет доступа для обновления

# Нет доступа для просмотра
source: No access to view
ru: Нет доступа для просмотра

# нет доступа для создания
source: No access to create
ru: Нет доступа для создания

# Нет доступа для создания
source: No access to create
ru: Нет доступа для создания

# Нет доступа для удаления
source: No access to delete
ru: Нет доступа для удаления

# Нет доступа к таймтейблу
source: No access to timetable
ru: Нет доступа к расписанию

# Нет маестри доступа для создания
source: No master access to create
ru: Нет прав мастера для создания

# Нет ни эмплоеров ни салонов
source: No employers or salons found
ru: Не найдено ни работодателей, ни салонов

# Нет прав для получения информации
source: No permission to retrieve information
ru: Нет прав для получения информации

# Нет прав на выдачу зарплаты
source: No rights to issue a salary
ru: Нет прав на выплату зарплаты

# Нет токена
source: No token provided
ru: Токен отсутствует

# ничего не кинули. хоть один пункт по зарплате киньте, А?
source: Nothing received. At least provide one payroll item!
ru: Ничего не прислали. Хоть один пункт по зарплате отправьте!

# Новое расписание контактирует со старым
source: translated schedule overlaps with the old one
ru: Новое расписание пересекается со старым

# Плохие даты выдачи зарплаты
source: Invalid payroll dates
ru: Некорректные даты выдачи зарплаты

# Плохой идентификатора таймзоны
source: Invalid timezone identifier
ru: Некорректный идентификатор часового пояса

# По ссылке перешли второй раз
source: The link has already been used once
ru: По ссылке уже переходили

# Профессионал не участвует аппоинтменте и не имеет прав
source: The professional is not involved in the appointment and has no rights
ru: Профессионал не участвует в записи и не имеет прав

# Профессионал уже работает в этом салоне
source: The professional is already working at this salon
ru: Профессионал уже работает в этом салоне

# Процедура уже существует
source: Procedure already exists
ru: Процедура уже существует

# Пытаются назначить аппоинтмент себе же
source: Attempting to book an appointment for oneself
ru: Попытка записаться к самому себе

# Пытаются удалить позицию овнера
source: Attempting to delete owner's position
ru: Пытаются удалить позицию владельца

# Работник нигде не работает
source: Employee is not working anywhere
ru: Сотрудник нигде не работает

# Рефреш токен уже умер
source: Refresh token has expired
ru: Рефреш токен уже истек

# Слишком большой permission set
source: Permission set is too large
ru: Набор прав слишком большой

# Создаваемый интервал для offtime, пересекается уже с существующими
source: The offtime interval being created overlaps with existing ones
ru: Создаваемый интервал времени пересекается с уже существующими

# создаваемый интервал для оффтайма пересекается уже с существующими
source: The offtime interval being created overlaps with existing ones
ru: Создаваемый интервал пересекается с уже существующими

# Тип не является изображением
source: The type is not an image
ru: Тип не является изображением

# Токен плохой
source: Invalid token
ru: Токен недействителен

# у offtime нет owner
source: Offtime has no owner
ru: У offtime нет владельца

# У offtime нет салона
source: Offtime has no salon
ru: Для данного интервала времени не найден салон

# У offtime нет эмплоера
source: Offtime has no employer
ru: Для данного интервала времени не найден работодатель

# у кешбокса нет даты создания
source: Cashbox has no creation date
ru: У кассового аппарата нет даты создания

# У кого-то в зарплате появилась неоднозначность из-за разных валют в операциях
source: Payroll ambiguity due to different currencies in operations
ru: В зарплате возникла неопределённость из-за разных валют в операциях

# у операции нет даты создания
source: Operation has no creation date
ru: У операции нет даты создания

# У профессионала нет прав
source: The professional has no rights
ru: У профессионала нет прав

# У профессионала нет прав на изменение
source: The professional does not have rights to make changes
ru: У профессионала нет прав на внесение изменений

# У профессионала нет прав на просмотр
source: The professional does not have permission to view
ru: У профессионала нет прав на просмотр

# У юзера нет кастомера
source: The user has no customer
ru: У пользователя нет клиента

# Увольняет себя
source: The professional is resigning themselves
ru: Профессионал увольняет себя

# Эмплоер с этим контактом уже существует в салоне
source: Employer with this contact already exists in the salon
ru: Работодатель с этим контактом уже существует в салоне

# Эмплоеру не принадлежат запрашиваемые контакты
source: The requested contacts do not belong to the employer
ru: Запрашиваемые контакты не принадлежат работодателю

# Язык не парсится
source: Unable to parse language
ru: Не удалось распознать язык
